<template>
  <div class="page404">
    <h1>Page Not Found</h1>
    <p>
      抱歉，您请求的页面不存在，您可以返回
      <router-link to="/" replace>
        <span class="home-link">
          首页
        </span>
      </router-link>
    </p>
    <div>
      <svg
        xmlns="http://www.w3.org/2000/svg"
        id="Capa_1"
        enable-background="new 0 0 512 512"
        height="320"
        viewBox="0 0 512 512"
        width="320"
      >
        <path d="m512 128-256-21.333-10.667 181.333 10.667 185.667h256z" fill="#9ccefd" />
        <path d="m0 128v345.667h256v-367z" fill="#c4e2fe" />
        <path
          d="m189.347 305.605h-16.545v21.317h-30.704v-21.317h-58.862v-20.522l49.954-69.521h32.613l-45.34 65.067h22.59v-18.931h29.75v18.931h16.545v24.976z"
          fill="#fc5b3f"
        />
        <path
          d="m428.764 305.605h-16.545v21.317h-30.704v-21.317h-58.863v-20.522l49.954-69.521h32.613l-45.34 65.067h22.59v-18.931h29.75v18.931h16.545z"
          fill="#fc3636"
        />
        <path d="m512 38.333h-256l-21.333 36.333 21.333 53.334h256z" fill="#efe2dd" />
        <path d="m89.666 38.333-14.999 47 14.999 42.667h166.334v-89.667z" fill="#f7f0eb" />
        <path d="m89.666 128h-89.666v-89.667h89.666z" fill="#fc5b3f" />
        <path
          d="m303.408 271.241c0-36.055-19.913-57.089-47.408-57.871l-10.667 10.63 10.667 15.188c9.196.906 15.75 9.925 15.75 32.054 0 22.128-6.554 31.147-15.75 32.053l-10.667 6.039 10.667 19.778c27.495-.782 47.408-21.815 47.408-57.871z"
          fill="#fc3636"
        />
        <path
          d="m254.409 303.377c-10.182 0-17.5-8.75-17.5-32.136s7.318-32.136 17.5-32.136c.539 0 1.068.031 1.591.082v-25.817c-.529-.015-1.056-.037-1.591-.037-28.477 0-49.158 21.159-49.158 57.908 0 36.75 20.681 57.908 49.158 57.908.535 0 1.061-.022 1.591-.037v-25.817c-.523.051-1.052.082-1.591.082z"
          fill="#fc5b3f"
        />
        <path d="m341.333 358.333h-85.333l-10.667 15 10.667 15h85.333z" fill="#f7f0eb" />
        <path d="m170.666 358.333h85.334v30h-85.334z" fill="#fffbf5" />
      </svg>
    </div>

  </div>
</template>

<style scoped>
.page404 {
  text-align: center;
  margin-top: 50px;
}
.home-link {
  font-size: 1.2em;
  letter-spacing: 2px;
  font-weight: bold;
  text-transform: uppercase;
}
</style>
